#ما دو دسته ماشین)مثلا پراید و اتوبوس( داریم. ما فقط اطلاعات ماشین ها )طول و ارتفاع(را داریم اما نوع ماشین را نمی دانیم
# )برای اطلاعات برچسب نداریم(. حال با روشKMeans میخواهیم نوع ماشین را مشخص کنیم.


#فراخواني کتابخانه هاي مورد نياز
from sklearn.cluster import KMeans # برای اجرای الگوریتم K-Means Clustering
import numpy as np # برای مدیریت آرایه‌های عددی

# تعریف داده‌های بدون برچسب (ویژگی‌ها: طول و ارتفاع ماشین)
X = np.array([[7, 3], [7, 4], [8, 3],[9, 3], [5, 2], [4, 3],[3,3]])

# ایجاد مدل K-Means با 2 خوشه و حداکثر 300 تکرار برای همگرایی
model = KMeans(n_clusters=2, max_iter=300).fit(X)

# نمایش برچسب‌های اختصاص داده شده به هر داده پس از خوشه‌بندی
print(model.labels_)

# پیش‌بینی خوشه‌ای که داده‌ی جدید [8,4] به آن تعلق دارد
print(model.predict([[8,4]]))

# نمایش مختصات مراکز هر خوشه
print(model.cluster_centers_)


#بصورت پیش فرض max_iter=300 است.نکته:

